wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_spi.h
/* SPI_DATA */
#define SPI_DATA_DATA                   BITS(0,15)                              /*!< data transfer register */

/* SPI_CRCPOLY */
#define SPI_CRCPOLY_CPR                 BITS(0,15)                              /*!< CRC polynomial register */

/* SPI_RCRC */
#define SPI_RCRC_RCR                    BITS(0,15)                              /*!< RX CRC register */

/* SPI_TCRC */
#define SPI_TCRC_TCR                    BITS(0,15)                              /*!< TX CRC register */

/* SPI_I2SCTL */
#define SPI_I2SCTL_CHLEN                BIT(0)                                  /*!< channel length */
#define SPI_I2SCTL_DTLEN                BITS(1,2)                               /*!< data length */
#define SPI_I2SCTL_CKPL                 BIT(3)                                  /*!< idle state clock polarity */
#define SPI_I2SCTL_I2SSTD               BITS(4,5)                               /*!< I2S standard selection */
#define SPI_I2SCTL_PCMSMOD              BIT(7)                                  /*!< PCM frame synchronization mode */
#define SPI_I2SCTL_I2SOPMOD             BITS(8,9)                               /*!< I2S operation mode */
#define SPI_I2SCTL_I2SEN                BIT(10)                                 /*!< I2S enable */
#define SPI_I2SCTL_I2SSEL               BIT(11)                                 /*!< I2S mode selection */

/* SPI_I2SPSC */
#define SPI_I2SPSC_DIV                  BITS(0,7)                               /*!< dividing factor for the prescaler */
#define SPI_I2SPSC_OF                   BIT(8)                                  /*!< odd factor for the prescaler */
#define SPI_I2SPSC_MCKOEN               BIT(9)                                  /*!< I2S MCK output enable */

/* SPI_QCTL(only for SPI0) */
#define SPI_QCTL_QMOD                   BIT(0)                                  /*!< quad-SPI mode enable */
#define SPI_QCTL_QRD                    BIT(1)                                  /*!< quad-SPI mode read select */

/* constants definitions */
/* SPI and I2S parameter struct definitions */
typedef struct
{   
    uint32_t device_mode;                                                       /*!< SPI master or slave */
    uint32_t trans_mode;                                                        /*!< SPI transtype */
    uint32_t frame_size;                                                        /*!< SPI frame size */
    uint32_t nss;                                                               /*!< SPI NSS control by handware or software */
    uint32_t endian;                                                            /*!< SPI big endian or little endian */
    uint32_t clock_polarity_phase;                                              /*!< SPI clock phase and polarity */
    uint32_t prescale;                                                          /*!< SPI prescale factor */
}spi_parameter_struct;

/* define the SPI interrupt flag position and its register index offset */
#define SPI_REG_VAL(offset)                 REG32((spi_periph) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6))
#define SPI_BIT_POS(val)                    ((uint32_t)(val) & 0x0000001FU)
#define SPI_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2) \
                                            (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16) | \
                                            (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define SPI_REG_VAL2(offset)                REG32((spi_periph) + ((uint32_t)(offset) >> 22))
#define SPI_BIT_POS2(val)                   (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define SPI_CTL1_REG_OFFSET                 ((uint32_t)0x00000004U)             /*!< CTL1 register offset */
#define SPI_STAT_REG_OFFSET                 ((uint32_t)0x00000008U)             /*!< STAT register offset */

/* SPI interrupt flags */
typedef enum {
    SPI_I2S_INT_FLAG_TBE       = SPI_REGIDX_BIT2(SPI_CTL1_REG_OFFSET, 7U, SPI_STAT_REG_OFFSET, 1U),  /*!< Transmit buffer empty interrupt flag */
    SPI_I2S_INT_FLAG_RBNE      = SPI_REGIDX_BIT2(SPI_CTL1_REG_OFFSET, 6U, SPI_STAT_REG_OFFSET, 0U),  /*!< Receive buffer not empty interrupt flag */
    SPI_I2S_INT_FLAG_RXORERR   = SPI_REGIDX_BIT2(SPI_CTL1_REG_OFFSET, 5U, SPI_STAT_REG_OFFSET, 6U),  /*!< RX overrun error interrupt flag */
    SPI_INT_FLAG_CONFERR       = SPI_REGIDX_BIT2(SPI_CTL1_REG_OFFSET, 5U, SPI_STAT_REG_OFFSET, 5U),  /*!< Config error interrupt flag */
    SPI_INT_FLAG_CRCERR        = SPI_REGIDX_BIT2(SPI_CTL1_REG_OFFSET, 5U, SPI_STAT_REG_OFFSET, 4U),  /*!< CRC error interrupt flag */
    I2S_INT_FLAG_TXURERR       = SPI_REGIDX_BIT2(SPI_CTL1_REG_OFFSET, 5U, SPI_STAT_REG_OFFSET, 3U),  /*!< TX underrun error interrupt flag */
    SPI_I2S_INT_FLAG_FERR      = SPI_REGIDX_BIT2(SPI_CTL1_REG_OFFSET, 5U, SPI_STAT_REG_OFFSET, 8U)   /*!< Format error interrupt flag */
} spi_interrupt_flag_enum;

/* SPI mode definitions */
#define SPI_MASTER                      (SPI_CTL0_MSTMOD | SPI_CTL0_SWNSS)      /*!< SPI as master */
#define SPI_SLAVE                       ((uint32_t)0x00000000U)                 /*!< SPI as slave */

/* SPI bidirectional transfer direction */
#define SPI_BIDIRECTIONAL_TRANSMIT      SPI_CTL0_BDOEN                          /*!< SPI work in transmit-only mode */
#define SPI_BIDIRECTIONAL_RECEIVE       (~SPI_CTL0_BDOEN)                       /*!< SPI work in receive-only mode */

/* SPI transmit type */
#define SPI_TRANSMODE_FULLDUPLEX        ((uint32_t)0x00000000U)                 /*!< SPI receive and send data at fullduplex communication */
#define SPI_TRANSMODE_RECEIVEONLY       SPI_CTL0_RO                             /*!< SPI only receive data */
#define SPI_TRANSMODE_BDRECEIVE         SPI_CTL0_BDEN                           /*!< bidirectional receive data */
#define SPI_TRANSMODE_BDTRANSMIT        (SPI_CTL0_BDEN | SPI_CTL0_BDOEN)        /*!< bidirectional transmit data*/

/* SPI frame size */
#define SPI_FRAMESIZE_16BIT             SPI_CTL0_FF16                           /*!< SPI frame size is 16 bits */
#define SPI_FRAMESIZE_8BIT              ((uint32_t)0x00000000U)                 /*!< SPI frame size is 8 bits */

/* SPI NSS control mode */
#define SPI_NSS_SOFT                    SPI_CTL0_SWNSSEN                        /*!< SPI NSS control by software */
#define SPI_NSS_HARD                    ((uint32_t)0x00000000U)                 /*!< SPI NSS control by hardware */

/* SPI transmit way */
#define SPI_ENDIAN_MSB                  ((uint32_t)0x00000000U)                 /*!< SPI transmit way is big endian: transmit MSB first */
#define SPI_ENDIAN_LSB                  SPI_CTL0_LF                             /*!< SPI transmit way is little endian: transmit LSB first */

/* SPI clock phase and polarity */
#define SPI_CK_PL_LOW_PH_1EDGE          ((uint32_t)0x00000000U)                 /*!< SPI clock polarity is low level and phase is first edge */
#define SPI_CK_PL_HIGH_PH_1EDGE         SPI_CTL0_CKPL                           /*!< SPI clock polarity is high level and phase is first edge */
#define SPI_CK_PL_LOW_PH_2EDGE          SPI_CTL0_CKPH                           /*!< SPI clock polarity is low level and phase is second edge */
#define SPI_CK_PL_HIGH_PH_2EDGE         (SPI_CTL0_CKPL | SPI_CTL0_CKPH)         /*!< SPI clock polarity is high level and phase is second edge */

/* SPI clock prescale factor */
#define CTL0_PSC(regval)                (BITS(3,5) & ((uint32_t)(regval) << 3))
#define SPI_PSC_2                       CTL0_PSC(0)                             /*!< SPI clock prescale factor is 2 */
#define SPI_PSC_4                       CTL0_PSC(1)                             /*!< SPI clock prescale factor is 4 */
#define SPI_PSC_8                       CTL0_PSC(2)                             /*!< SPI clock prescale factor is 8 */
#define SPI_PSC_16                      CTL0_PSC(3)                             /*!< SPI clock prescale factor is 16 */
#define SPI_PSC_32                      CTL0_PSC(4)                             /*!< SPI clock prescale factor is 32 */
#define SPI_PSC_64                      CTL0_PSC(5)                             /*!< SPI clock prescale factor is 64 */
#define SPI_PSC_128                     CTL0_PSC(6)                             /*!< SPI clock prescale factor is 128 */
#define SPI_PSC_256                     CTL0_PSC(7)                             /*!< SPI clock prescale factor is 256 */

